___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="CLRSWY"></p>

___

<h1><p style="text-align: center;">Pandas Focus </p><h1>

# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

In [1]:
import numpy as np
import pandas as pd

## CSV

### CSV Input

Reading a file in same folder. Here the file is 'example'.

In [2]:
df = pd.read_csv('plus.csv')

In [3]:
df

               label  expected  augend  addend
0  positive positive         4       3       1
1  positive negative        -1       1      -2

Another example

In [4]:
pd.read_csv('header.csv')

          label  expected target
0  empty string      True    NaN
1  plain string     False  hello

Reading a file via filepath.

In [9]:
pd.read_csv('/Users/clarusway_repo/Untitled Folder/Focus_Group/plus.csv')

               label  expected  augend  addend
0  positive positive         4       3       1
1  positive negative        -1       1      -2

viewing docstring of read_csv.

In [5]:
?pd.read_csv

Showing some parameters.

In [17]:
pd.read_csv('tips.csv', index_col=None, header=0, dtype={'total_bill':float})

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [22]:
df1 = pd.read_csv('tips.csv', index_col=None, header=0, dtype={'total_bill':str, 'tip':str})
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    object
 1   tip         244 non-null    object
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: int64(1), object(6)
memory usage: 13.5+ KB

More on parameters.

In [25]:
pd.read_csv('header.csv', usecols=['label', 'expected', 'target'])[['expected', 'target', 'label']]

   expected target         label
0      True    NaN  empty string
1     False  hello  plain string

In [27]:
pd.read_csv('ornekcsv.csv', sep=';')

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

### CSV Output

Remember we obtained the df at the begining.

In [28]:
df

               label  expected  augend  addend
0  positive positive         4       3       1
1  positive negative        -1       1      -2

Let's modify it more. Drop the column 'addend'.

In [29]:
df.drop('addend', axis=1, inplace=True)

In [30]:
df

               label  expected  augend
0  positive positive         4       3
1  positive negative        -1       1

Writing df to a csv file.

In [37]:
df.to_csv('example1.csv')

In [38]:
pd.read_csv('example1.csv')

   Unnamed: 0              label  expected  augend
0           0  positive positive         4       3
1           1  positive negative        -1       1

With or without index.

In [41]:
pd.read_csv('example1.csv', index_col=0)

               label  expected  augend
0  positive positive         4       3
1  positive negative        -1       1

## Excel
Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.

### Excel Input

In [42]:
df = pd.read_excel('Excel_Sample.xlsx')

In [43]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

Read desired sheet name of an excel file

In [46]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet2')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [51]:
df1 = pd.read_excel('Excel_Sample.xlsx')

In [52]:
df1

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### Excel Output

We can also write an excel file with a specific sheet name.

In [53]:
df.to_excel('Excel_Sample.xlsx', sheet_name= 'Sheet1', index=False)

### HTML Input

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects:

In [54]:
df2 = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [58]:
df2[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
1,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
2,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
3,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
4,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
...,...,...,...,...,...,...
557,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
558,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
559,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
560,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
561,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

____

In [62]:
df3 = pd.read_html('https://www.imdb.com/chart/top/', index_col=0)

In [65]:
df3[0]

,Rank & Title,IMDb Rating,Your Rating,Unnamed: 4
NaN,1. The Shawshank Redemption (1994),9.2,12345678910 NOT YET RELEASED Seen,NaN
NaN,2. The Godfather (1972),9.1,12345678910 NOT YET RELEASED Seen,NaN
NaN,3. The Godfather: Part II (1974),9.0,12345678910 NOT YET RELEASED Seen,NaN
NaN,4. The Dark Knight (2008),9.0,12345678910 NOT YET RELEASED Seen,NaN
NaN,5. 12 Angry Men (1957),8.9,12345678910 NOT YET RELEASED Seen,NaN
...,...,...,...,...
NaN,246. The Terminator (1984),8.0,12345678910 NOT YET RELEASED Seen,NaN
NaN,247. Aladdin (1992),8.0,12345678910 NOT YET RELEASED Seen,NaN
NaN,248. Mandariinid (2013),8.0,12345678910 NOT YET RELEASED Seen,NaN
NaN,249. Koe no katachi (2016),8.0,12345678910 NOT YET RELEASED Seen,NaN
NaN,250. Kumonosu-jô (1957),8.0,12345678910 NOT YET RELEASED Seen,NaN

Another example.

In [66]:
df4 = pd.read_html('https://en.wikipedia.org/wiki/Pythonidae')

In [80]:
df5 = df4[1]

In [83]:
type(df5)

pandas.core.frame.DataFrame

# End of The Session